# Inflows and Outflows
- This notebook studies how sections differ based on their 'inflows' and 'outflows'
- An inflow is when a ride enters a location that it did not start in 
- An outflow is when a ride leaves its starting location
- A 'local' ride begins and ends in the same location

## Findings
- Locations can differ significantly in their net inflows and outflows
- The majority of zones with the highest outflow rates are parks
- Airports feature a higher outflow rate than inflow rate

In [1]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://root:root@localhost:5432/uber')
engine.connect()

In [2]:
%load_ext sql
%sql postgresql://root:root@localhost:5432/uber

In [3]:
%%sql
SELECT * FROM main LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(3761537, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 7, 13, 45, 13), None, datetime.datetime(2019, 7, 7, 13, 50, 14), datetime.datetime(2019, 7, 7, 14, 31, 38), 74, 78, 5.798, 2484, 16.13, 0.62, 0.42, 1.49, 0.0, None, 0.0, 26.86, 'N', 'N', 'N', 'N', 'N', 13, 'Sunday', 'Lyft', 0),
 (4514778, 'HV0003', 'B02872', 'B02872', datetime.datetime(2019, 7, 8, 20, 55, 7), datetime.datetime(2019, 7, 8, 20, 55, 26), datetime.datetime(2019, 7, 8, 20, 58, 37), datetime.datetime(2019, 7, 8, 21, 10, 55), 14, 22, 3.75, 738, 11.26, 0.0, 0.0, 0.98, 0.0, None, 0.0, 10.2, 'N', 'N', ' ', 'N', ' ', 20, 'Monday', 'Uber', 0),
 (13459379, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 21, 19, 38, 31), None, datetime.datetime(2019, 7, 21, 19, 43, 25), datetime.datetime(2019, 7, 21, 19, 56, 26), 18, 247, 2.503, 781, 13.0, 0.0, 0.24, 0.84, 0.0, None, 0.0, 0.0, 'Y', 'N', 'N', 'N', 'N', 19, 'Sunday', 'Lyft', 0),
 (12008064, 'HV0003', 'B02877', 'B02877', datetime.datetime(2019, 7, 19, 23, 4, 25), datetime.datetime(2019, 7, 19, 23, 7, 19), datetime.datetime(2019, 7, 19, 23, 7, 31), datetime.datetime(2019, 7, 19, 23, 10, 59), 108, 108, 1.08, 208, 5.15, 0.0, 0.0, 0.45, 0.0, None, 0.0, 5.39, 'N', 'N', ' ', 'N', ' ', 23, 'Friday', 'Uber', 0),
 (3745204, 'HV0003', 'B02889', 'B02889', datetime.datetime(2019, 7, 7, 13, 23, 57), datetime.datetime(2019, 7, 7, 13, 25, 35), datetime.datetime(2019, 7, 7, 13, 27, 19), datetime.datetime(2019, 7, 7, 13, 38, 54), 35, 61, 1.52, 695, 9.54, 0.0, 0.0, 0.83, 0.0, None, 0.0, 7.39, 'N', 'N', ' ', 'N', ' ', 13, 'Sunday', 'Uber', 0),
 (2053896, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 4, 16, 42, 43), None, datetime.datetime(2019, 7, 4, 16, 45, 14), datetime.datetime(2019, 7, 4, 17, 0, 21), 256, 97, 2.924, 907, 16.53, 0.0, 0.31, 1.11, 0.0, None, 0.0, 10.69, 'N', 'N', 'N', 'N', 'N', 16, 'Thursday', 'Lyft', 0),
 (19436197, 'HV0005', 'B02510', None, datetime.datetime(2019, 7, 30, 18, 54, 46), None, datetime.datetime(2019, 7, 30, 18, 56, 5), datetime.datetime(2019, 7, 30, 19, 4, 4), 173, 95, 1.934, 479, 10.75, 0.0, 0.27, 0.95, 0.0, None, 0.0, 6.07, 'N', 'N', 'N', 'N', 'N', 18, 'Tuesday', 'Lyft', 0),
 (17805213, 'HV0003', 'B02883', 'B02883', datetime.datetime(2019, 7, 28, 2, 47, 12), datetime.datetime(2019, 7, 28, 2, 48, 19), datetime.datetime(2019, 7, 28, 2, 50, 2), datetime.datetime(2019, 7, 28, 2, 59, 39), 164, 224, 1.87, 578, 8.18, 0.0, 0.0, 0.78, 2.75, None, 0.0, 6.82, 'N', 'N', ' ', 'N', 'N', 2, 'Sunday', 'Uber', 0),
 (6741838, 'HV0003', 'B02764', 'B02764', datetime.datetime(2019, 7, 12, 12, 29, 10), datetime.datetime(2019, 7, 12, 12, 29, 51), datetime.datetime(2019, 7, 12, 12, 32, 26), datetime.datetime(2019, 7, 12, 13, 6, 56), 7, 182, 8.31, 2071, 25.13, 6.12, 0.0, 2.71, 0.0, None, 0.0, 32.3, 'N', 'N', ' ', 'N', ' ', 12, 'Friday', 'Uber', 0),
 (3420349, 'HV0003', 'B02836', 'B02836', datetime.datetime(2019, 7, 6, 22, 46, 18), datetime.datetime(2019, 7, 6, 22, 47, 23), datetime.datetime(2019, 7, 6, 22, 49, 12), datetime.datetime(2019, 7, 6, 22, 57, 10), 225, 49, 1.18, 477, 7.71, 0.0, 0.0, 0.67, 0.0, None, 0.0, 5.39, 'N', 'N', ' ', 'N', ' ', 22, 'Saturday', 'Uber', 0)]

In [4]:
%%sql
DROP TABLE IF EXISTS inflows ;

CREATE TEMPORARY TABLE inflows AS 
SELECT "PULocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "PULocationID"
ORDER BY "PULocationID";

SELECT * FROM inflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
259 rows affected.
10 rows affected.

[(1, Decimal('4')),
 (2, Decimal('1')),
 (3, Decimal('181')),
 (4, Decimal('442')),
 (5, Decimal('18')),
 (6, Decimal('36')),
 (7, Decimal('872')),
 (8, Decimal('5')),
 (9, Decimal('79')),
 (10, Decimal('253'))]

In [5]:
%%sql
DROP TABLE IF EXISTS outflows;

CREATE TEMPORARY TABLE outflows AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" != "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM outflows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
259 rows affected.
10 rows affected.

[(1, Decimal('549')),
 (2, Decimal('1')),
 (3, Decimal('163')),
 (4, Decimal('351')),
 (5, Decimal('21')),
 (6, Decimal('46')),
 (7, Decimal('836')),
 (8, Decimal('8')),
 (9, Decimal('81')),
 (10, Decimal('201'))]

In [6]:
%%sql
DROP TABLE IF EXISTS locals;

CREATE TEMPORARY TABLE locals AS 
SELECT "DOLocationID" "location",
COALESCE(COUNT(*), 0)::numeric count
FROM main
WHERE "PULocationID" = "DOLocationID"
GROUP BY "DOLocationID"
ORDER BY "DOLocationID";

SELECT * FROM locals LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
231 rows affected.
10 rows affected.

[(3, Decimal('19')),
 (4, Decimal('1')),
 (5, Decimal('1')),
 (6, Decimal('2')),
 (7, Decimal('143')),
 (9, Decimal('9')),
 (10, Decimal('20')),
 (11, Decimal('5')),
 (13, Decimal('7')),
 (14, Decimal('118'))]

In [7]:
%%sql
SELECT * FROM zones LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
10 rows affected.

[(0, 1, 'EWR', 'Newark Airport', 'EWR'),
 (1, 2, 'Queens', 'Jamaica Bay', 'Boro Zone'),
 (2, 3, 'Bronx', 'Allerton/Pelham Gardens', 'Boro Zone'),
 (3, 4, 'Manhattan', 'Alphabet City', 'Yellow Zone'),
 (4, 5, 'Staten Island', 'Arden Heights', 'Boro Zone'),
 (5, 6, 'Staten Island', 'Arrochar/Fort Wadsworth', 'Boro Zone'),
 (6, 7, 'Queens', 'Astoria', 'Boro Zone'),
 (7, 8, 'Queens', 'Astoria Park', 'Boro Zone'),
 (8, 9, 'Queens', 'Auburndale', 'Boro Zone'),
 (9, 10, 'Queens', 'Baisley Park', 'Boro Zone')]

In [8]:
%%sql
DROP TABLE IF EXISTS flows;

CREATE TEMPORARY TABLE flows AS 
SELECT 
zones."Zone", 
zones."Borough", 
COALESCE(inflows.count, 0) inflows,
COALESCE(outflows.count, 0) outflows,
COALESCE(locals.count, 0) locals
FROM zones 
    LEFT JOIN inflows 
    ON zones."LocationID" = inflows.location
    LEFT JOIN outflows 
    ON zones."LocationID" = outflows.location
    LEFT JOIN locals 
    ON zones."LocationID" = locals.location
;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
263 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', 'Bronx', Decimal('181'), Decimal('163'), Decimal('19')),
 ('Alphabet City', 'Manhattan', Decimal('442'), Decimal('351'), Decimal('1')),
 ('Arden Heights', 'Staten Island', Decimal('18'), Decimal('21'), Decimal('1')),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('36'), Decimal('46'), Decimal('2')),
 ('Astoria', 'Queens', Decimal('872'), Decimal('836'), Decimal('143')),
 ('Auburndale', 'Queens', Decimal('79'), Decimal('81'), Decimal('9')),
 ('Baisley Park', 'Queens', Decimal('253'), Decimal('201'), Decimal('20')),
 ('Bath Beach', 'Brooklyn', Decimal('97'), Decimal('90'), Decimal('5')),
 ('Battery Park City', 'Manhattan', Decimal('569'), Decimal('616'), Decimal('7')),
 ('Bay Ridge', 'Brooklyn', Decimal('380'), Decimal('392'), Decimal('118'))]

In [9]:
%%sql
ALTER TABLE flows 
ADD total int;

UPDATE flows
SET total = inflows + outflows + locals;

SELECT * FROM flows LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
Done.
263 rows affected.
10 rows affected.

[('Allerton/Pelham Gardens', 'Bronx', Decimal('181'), Decimal('163'), Decimal('19'), 363),
 ('Alphabet City', 'Manhattan', Decimal('442'), Decimal('351'), Decimal('1'), 794),
 ('Arden Heights', 'Staten Island', Decimal('18'), Decimal('21'), Decimal('1'), 40),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('36'), Decimal('46'), Decimal('2'), 84),
 ('Astoria', 'Queens', Decimal('872'), Decimal('836'), Decimal('143'), 1851),
 ('Auburndale', 'Queens', Decimal('79'), Decimal('81'), Decimal('9'), 169),
 ('Baisley Park', 'Queens', Decimal('253'), Decimal('201'), Decimal('20'), 474),
 ('Bath Beach', 'Brooklyn', Decimal('97'), Decimal('90'), Decimal('5'), 192),
 ('Battery Park City', 'Manhattan', Decimal('569'), Decimal('616'), Decimal('7'), 1192),
 ('Bay Ridge', 'Brooklyn', Decimal('380'), Decimal('392'), Decimal('118'), 890)]

### Highest Percent of Inflows

In [10]:
%%sql
SELECT 
flows."Zone",
flows."Borough",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
inflows, outflows
FROM flows
WHERE (inflows + outflows > 0)
ORDER BY (inflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Willets Point', 'Queens', Decimal('66.67'), Decimal('14'), Decimal('7')),
 ('Green-Wood Cemetery', 'Brooklyn', Decimal('66.67'), Decimal('10'), Decimal('5')),
 ('Bellerose', 'Queens', Decimal('61.96'), Decimal('57'), Decimal('33')),
 ('Rossville/Woodrow', 'Staten Island', Decimal('61.11'), Decimal('22'), Decimal('13')),
 ('Highbridge Park', 'Manhattan', Decimal('60.00'), Decimal('15'), Decimal('10')),
 ('New Dorp/Midland Beach', 'Staten Island', Decimal('58.21'), Decimal('39'), Decimal('24')),
 ('Pelham Bay', 'Bronx', Decimal('57.98'), Decimal('109'), Decimal('75')),
 ('Columbia Street', 'Brooklyn', Decimal('57.52'), Decimal('65'), Decimal('48')),
 ('Flatiron', 'Manhattan', Decimal('57.48'), Decimal('711'), Decimal('518')),
 ('Oakland Gardens', 'Queens', Decimal('57.36'), Decimal('74'), Decimal('51')),
 ('Lincoln Square West', 'Manhattan', Decimal('56.41'), Decimal('493'), Decimal('375')),
 ('Ocean Parkway South', 'Brooklyn', Decimal('56.25'), Decimal('99'), Decimal('74')),
 ('Clinton West', 'Manhattan', Decimal('56.18'), Decimal('727'), Decimal('562')),
 ('Alphabet City', 'Manhattan', Decimal('55.67'), Decimal('442'), Decimal('351')),
 ('Lenox Hill West', 'Manhattan', Decimal('55.62'), Decimal('772'), Decimal('600')),
 ('Rosedale', 'Queens', Decimal('55.61'), Decimal('119'), Decimal('79')),
 ('Queens Village', 'Queens', Decimal('55.45'), Decimal('224'), Decimal('149')),
 ('Forest Park/Highland Park', 'Queens', Decimal('55.17'), Decimal('16'), Decimal('13')),
 ('Sutton Place/Turtle Bay North', 'Manhattan', Decimal('54.97'), Decimal('702'), Decimal('569')),
 ('Little Italy/NoLiTa', 'Manhattan', Decimal('54.87'), Decimal('794'), Decimal('643'))]

### Highest Percent of Outflows

In [11]:
%%sql
SELECT 
flows."Zone",
flows."Borough",
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
inflows, outflows
FROM flows
WHERE (total > 0)
ORDER BY (outflows / (total)) DESC
LIMIT 20;

 * postgresql://root:***@localhost:5432/uber
20 rows affected.

[('Newark Airport', 'EWR', Decimal('99.28'), Decimal('4'), Decimal('549')),
 ('Saint Michaels Cemetery/Woodside', 'Queens', Decimal('75.00'), Decimal('1'), Decimal('3')),
 ('Freshkills Park', 'Staten Island', Decimal('75.00'), Decimal('2'), Decimal('6')),
 ('Randalls Island', 'Manhattan', Decimal('63.22'), Decimal('32'), Decimal('55')),
 ('Inwood Hill Park', 'Manhattan', Decimal('62.96'), Decimal('20'), Decimal('34')),
 ('Astoria Park', 'Queens', Decimal('61.54'), Decimal('5'), Decimal('8')),
 ('Flushing Meadows-Corona Park', 'Queens', Decimal('59.14'), Decimal('76'), Decimal('110')),
 ('Broad Channel', 'Queens', Decimal('58.82'), Decimal('7'), Decimal('10')),
 ('Roosevelt Island', 'Manhattan', Decimal('58.20'), Decimal('48'), Decimal('71')),
 ('Breezy Point/Fort Tilden/Riis Beach', 'Queens', Decimal('57.41'), Decimal('22'), Decimal('31')),
 ('Penn Station/Madison Sq West', 'Manhattan', Decimal('56.97'), Decimal('868'), Decimal('1161')),
 ('Financial District South', 'Manhattan', Decimal('56.72'), Decimal('235'), Decimal('308')),
 ('Pelham Bay Park', 'Bronx', Decimal('55.21'), Decimal('40'), Decimal('53')),
 ('Manhattan Beach', 'Brooklyn', Decimal('55.08'), Decimal('101'), Decimal('141')),
 ('Battery Park', 'Manhattan', Decimal('54.79'), Decimal('33'), Decimal('40')),
 ('JFK Airport', 'Queens', Decimal('54.78'), Decimal('1527'), Decimal('1931')),
 ('Arrochar/Fort Wadsworth', 'Staten Island', Decimal('54.76'), Decimal('36'), Decimal('46')),
 ('Bloomfield/Emerson Hill', 'Staten Island', Decimal('54.29'), Decimal('77'), Decimal('114')),
 ('Fresh Meadows', 'Queens', Decimal('53.89'), Decimal('89'), Decimal('104')),
 ('Prospect Park', 'Brooklyn', Decimal('53.71'), Decimal('80'), Decimal('94'))]

### Airports

In [12]:
%%sql
SELECT 
flows."Zone",
ROUND(
    100*inflows / (total)
,2) inflow_percent, 
ROUND(
    100*outflows / (total)
,2) outflow_percent, 
ROUND(
    100*locals / (total)
,2) local_percent, 
total
FROM flows
WHERE "Zone" LIKE '%Airport%'
ORDER BY (inflows / (total)) ASC
LIMIT 10;

 * postgresql://root:***@localhost:5432/uber
3 rows affected.

[('Newark Airport', Decimal('0.72'), Decimal('99.28'), Decimal('0.00'), 553),
 ('JFK Airport', Decimal('43.32'), Decimal('54.78'), Decimal('1.90'), 3525),
 ('LaGuardia Airport', Decimal('47.53'), Decimal('52.22'), Decimal('0.25'), 3541)]